tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "d12frosted/emacs-plus"
tap "mongodb/brew"
tap "hashicorp/tap"

# terminal
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "tmux"
brew "git"
brew "git-extras"
brew "bat"
brew "shellcheck"
brew "tree"
brew "fd"

# search
brew "ripgrep"
brew "the_silver_searcher"
brew "fzf"

# editor
brew "vim"
brew "neovim"
brew "universal-ctags"
brew "cmake" # prereq for vterm/emacs
brew "libvterm" # prereq for vterm/emacs
brew "sqlite" # prereq for magit/emacs
brew "aspell" # prereq for flyspell/emacs
brew "gnu-tar" # prereq for emacs
brew "emacs-plus", args: ["with-spacemacs-icon"]
brew "yamllint"

# productivity
brew "mas"
brew "1password-cli"

# programming tools
brew "hashicorp/tap/terraform"
brew "tfenv"
brew "grep"
brew "mongodb/brew/mongodb-community"
brew "jq"
brew "go"
brew "groovy"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "direnv"
brew "httpie"

# fonts
cask "font-fira-code"

# mac app store apps
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
